app/controllers/user_controller.rb

  def new
    if request.post?
      @user = User.new(params[:user])
      @user.ip_address = ip_address
      if @user.save
---
INSERT INTO "users" ("salt", "reset_token", "created_at", "remember_token_expires_at", "updated_at", "username", "hashed_password", "last_login_date", "lastname", "activation_id", "firstname", "remember_token", "email", "ip_address", "active") VALUES('mvsOBTOX8z', NULL, '2010-08-20 05:28:54', NULL, '2010-08-20 05:28:54', 'test1', '8dbdf7cb033c04d411e05b49a9c4a20c370b19ed', NULL, 'ln1', '7cbbdc1ce3cf0f2e9380cc1445c86d16f50be72d', 'fn1', NULL, 'test1@gmail.com', '127.0.0.1', NULL)

  def activate
    # check if activation id is valid.
    unless params[:activation_id].blank?
      user = User.find(:first, :conditions =>
                      {:activation_id => params[:activation_id]})
---
SELECT * FROM "users" WHERE ("users"."activation_id" = '787aa32e3770a3357542de29b4dd5708e56558c5') LIMIT 1

  def send_password_reset
    # check if email is valid. make a token and send an email to the user.
    if @user = User.find(:first, :conditions => {:email => params[:email]})
      flash.now[:notice] = "Password reset instructions sent."
      @user.make_reset_token
      puts @user.reset_token
      if @user.save(false)
---
SELECT "users".id FROM "users" WHERE ("users"."email" = 'test4@gmail.com' AND "users".id <> 4) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-08-12 00:18:06', "reset_token" = '886baf08dfca6eebd4281126bf70d75b63a604f4' WHERE "id" = 4

  def reset_password
    # check if the reset token is valid.
    if params[:reset_token].present?
      unless @user = User.find(:first,
                               :conditions => {:reset_token => params[:reset_token]})
---
SELECT * FROM "users" WHERE ("users"."reset_token" = 'ce55ca901ecf7144070518fe65df5452ac3afdc2') LIMIT 1

  def update_password
    # check if the reset token exists for the user.
    if @user = User.find(:first,
                         :conditions => {:reset_token => params[:reset_token]})
      @user.password = params[:password]
      @user.password_confirmation = params[:password_confirmation]
      @user.clear_reset_token
      if @user.save(false)
---
SELECT * FROM "users" WHERE ("users"."reset_token" = '') LIMIT 1
UPDATE "users" SET "updated_at" = '2010-08-12 03:10:01', "hashed_password" = 'a9c345dc78dfefe40c787ab200f106c584abc1e6', "reset_token" = NULL WHERE "id" = 4